
## Plan Result

[CI link](https://github.com/l-1cm-l/gha_playground/actions/runs/13589226099)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_s3_bucket.example_ex_3
* Delete
  * aws_s3_bucket.example_ex_2


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.example_ex_2 will be destroyed
  # (because aws_s3_bucket.example_ex_2 is not in configuration)
  - resource "aws_s3_bucket" "example_ex_2" {
      - arn                         = "arn:aws:s3:::202502121629t-ex-2" -> null
      - bucket                      = "202502121629t-ex-2" -> null
      - bucket_domain_name          = "202502121629t-ex-2.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "202502121629t-ex-2.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "202502121629t-ex-2" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "f94ae5937e7d4a045b74ecea6c32355c30133c80cd941b97f97b97cdd0a4608e" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.example_ex_3 will be created
  + resource "aws_s3_bucket" "example_ex_3" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "202502121629t-ex-3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"aws-googlecloud-terraform-plan","PRNumber":46,"Program":"tfcmt","SHA1":"40d4f8f906dc472080011c287366a58cc3e3cf38","Vars":{},"WorkflowName":"terraform-plan"} -->